titusbspgit/DeviceDrivers/GPIO/20260417-151230-TMS320C6452 DSP-Driver/tms320c6452_dsp_pin_multiplexing_control_test.c
#include <stdint.h>
#include <stdbool.h>
#include "tms320c6452_dsp_pin_multiplexing_control.h"

static volatile uint32_t pass_cnt = 0u;
static volatile uint32_t fail_cnt = 0u;

static void expect_bool(bool c){ if(c) pass_cnt++; else fail_cnt++; }
static void expect_int(int a,int b){ if(a==b) pass_cnt++; else fail_cnt++; }

int main(void)
{
    /* Validate range */
    if (tms320c6452_dsp_pin_multiplexing_control_validate(0u)) pass_cnt++; else fail_cnt++;
    if (tms320c6452_dsp_pin_multiplexing_control_validate(31u)) pass_cnt++; else fail_cnt++;
    if (!tms320c6452_dsp_pin_multiplexing_control_validate(32u)) pass_cnt++; else fail_cnt++;

    /* Configuration is UNKNOWN -> expect failure */
    if (!tms320c6452_dsp_pin_multiplexing_control_configure_gpio(0u)) pass_cnt++; else fail_cnt++;

    /* Query UNKNOWN -> expect -1 */
    if (tms320c6452_dsp_pin_multiplexing_control_query_function(0u) == -1) pass_cnt++; else fail_cnt++;

    while(1){ }
    return 0;
}
